In [11]:
import pandas as pd

In [19]:
row1 =  [ "남성", "김효관", "42", "서울", 80]
row2 =  [ "여성", "안민정", "40", "창원", 75]
row3 =  [ "남성", "김어진", "10", "서울", 65]
row4 =  [ "남성", "이종수", "42", "경기도", 95]
row5 =  [ "여성", "이지슬", "26", "경기도", 70]

In [20]:
indata = pd.DataFrame([row1, row2, row3, row4, row5])

In [21]:
indata.columns = ["성별", "이름", "나이", "거주지", "포인트"]

In [24]:
indata

   성별   이름  나이  거주지  포인트
0  남성  김효관  42   서울   80
1  여성  안민정  40   창원   75
2  남성  김어진  10   서울   65
3  남성  이종수  42  경기도   95
4  여성  이지슬  26  경기도   70

In [25]:
indata.dtypes

성별     object
이름     object
나이     object
거주지    object
포인트     int64
dtype: object

In [ ]:
### 성별 해피포인트 평균

In [26]:
import numpy as np

In [ ]:
### 그룹 키를 성별로 잡고, 해피포인트를 대상으로 집계 함수를 사용한다.
### 사용할 집계 함수로 mean을 사용한다.

In [37]:
groupKey = ["성별"]

In [38]:
genderPointMean = indata.groupby(by=groupKey)["포인트"].agg(["mean"])

In [39]:
genderPointMean

    mean
성별
남성  80.0
여성  72.5

In [40]:
groupKeys = ["성별", "거주지"]

In [48]:
genRegPmeans = indata.groupby(by=groupKeys)["포인트"].agg(["mean"])

In [49]:
genRegPmeans

        mean
성별 거주지
남성 경기도  95.0
   서울   72.5
여성 경기도  70.0
   창원   75.0

In [55]:
indata2 = pd.read_csv("../../../stdcode6/dataset/kopo_channel_seasonality_new.csv")

In [56]:
indata2.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [61]:
indata2["YEAR"] = indata2.YEARWEEK.astype(str).str[0:4]

In [72]:
indata2

       REGIONID    PRODUCT  YEARWEEK      QTY  YEAR
0           A60   PRODUCT4    201402     71.0  2014
1           A60  PRODUCT59    201402  22275.0  2014
2           A60  PRODUCT34    201402   4463.0  2014
3           A60  PRODUCT47    201402      0.0  2014
4           A60  PRODUCT56    201402     23.0  2014
...         ...        ...       ...      ...   ...
124653      A10  PRODUCT60    201630    824.0  2016
124654      A10  PRODUCT56    201630    275.0  2016
124655      A10  PRODUCT61    201630      0.0  2016
124656      A10  PRODUCT12    201630  15021.0  2016
124657      A10   PRODUCT1    201630    568.0  2016

[124658 rows x 5 columns]

In [63]:
groupKeyss = ["YEAR"]

In [68]:
indata2.groupby(groupKeyss)["QTY"].agg(["mean"])

              mean
YEAR
2014   6923.716801
2015   9762.377617
2016  10146.129069

In [71]:
groupKey1 = ["REGIONID", "PRODUCT", "YEAR"]

In [73]:
a60p4Data = indata2.loc[(indata2.REGIONID == "A60") &
            (indata2.PRODUCT == "PRODUCT4")]

In [75]:
a60p4Data.shape

(157, 5)

In [78]:
a60p4Data2 = a60p4Data.loc[a60p4Data.YEARWEEK.astype(str).str[4:]!="53"]

In [79]:
a60p4Data2

       REGIONID   PRODUCT  YEARWEEK   QTY  YEAR
0           A60  PRODUCT4    201402  71.0  2014
983         A60  PRODUCT4    201401  16.0  2014
1457        A60  PRODUCT4    201403  51.0  2014
2784        A60  PRODUCT4    201406  19.0  2014
3428        A60  PRODUCT4    201404  21.0  2014
...         ...       ...       ...   ...   ...
120309      A60  PRODUCT4    201640  31.0  2016
120660      A60  PRODUCT4    201609  45.0  2016
121454      A60  PRODUCT4    201612  45.0  2016
121967      A60  PRODUCT4    201629  29.0  2016
124386      A60  PRODUCT4    201633  22.0  2016

[156 rows x 5 columns]

In [80]:
a60p4Data2.shape

(156, 5)

In [84]:
a60p4Data3 = a60p4Data2.groupby(["REGIONID", "YEARWEEK"])["QTY"].agg(["mean"]).reset_index()

In [85]:
a60p4Data3

    REGIONID  YEARWEEK  mean
0        A60    201401  16.0
1        A60    201402  71.0
2        A60    201403  51.0
3        A60    201404  21.0
4        A60    201405  18.0
..       ...       ...   ...
151      A60    201648  19.0
152      A60    201649  11.0
153      A60    201650  11.0
154      A60    201651  15.0
155      A60    201652  12.0

[156 rows x 3 columns]

In [ ]:
## 그룹바이 열심히 하자

In [ ]:
## Python, DB 열심히 공부하자